yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af51a8.h
/* Global configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWO         : 1;
  unsigned char AL          : 1;
} __BITS_CPU_CFG_GCR;
#endif
__IO_REG8_BIT(CPU_CFG_GCR, 0x7F60, __READ_WRITE, __BITS_CPU_CFG_GCR);


/*-------------------------------------------------------------------------
 *      CPU bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define CPU_CCR_C                CPU_CCR_bit.C
#define CPU_CCR_Z                CPU_CCR_bit.Z
#define CPU_CCR_NF               CPU_CCR_bit.NF
#define CPU_CCR_I0               CPU_CCR_bit.I0
#define CPU_CCR_H                CPU_CCR_bit.H
#define CPU_CCR_I1               CPU_CCR_bit.I1
#define CPU_CCR_V                CPU_CCR_bit.V

#define CPU_CFG_GCR_SWO          CPU_CFG_GCR_bit.SWO
#define CPU_CFG_GCR_AL           CPU_CFG_GCR_bit.AL

#endif

/*-------------------------------------------------------------------------
 *      CPU bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CPU_CCR_C           0x01
#define MASK_CPU_CCR_Z           0x02
#define MASK_CPU_CCR_NF          0x04
#define MASK_CPU_CCR_I0          0x08
#define MASK_CPU_CCR_H           0x10
#define MASK_CPU_CCR_I1          0x20
#define MASK_CPU_CCR_V           0x80

#define MASK_CPU_CFG_GCR_SWO     0x01
#define MASK_CPU_CFG_GCR_AL      0x02


/*-------------------------------------------------------------------------
 *      SWIM register definitions
 *-----------------------------------------------------------------------*/
/* SWIM control status register */
__IO_REG8    (SWIM_CSR,    0x7F80, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      DM register definitions
 *-----------------------------------------------------------------------*/
/* DM breakpoint 1 register extended byte */
__IO_REG8    (DM_BK1RE,    0x7F90, __READ_WRITE);
/* DM breakpoint 1 register high byte */
__IO_REG8    (DM_BK1RH,    0x7F91, __READ_WRITE);
/* DM breakpoint 1 register low byte */
__IO_REG8    (DM_BK1RL,    0x7F92, __READ_WRITE);
/* DM breakpoint 2 register extended byte */
__IO_REG8    (DM_BK2RE,    0x7F93, __READ_WRITE);
/* DM breakpoint 2 register high byte */
__IO_REG8    (DM_BK2RH,    0x7F94, __READ_WRITE);
/* DM breakpoint 2 register low byte */
__IO_REG8    (DM_BK2RL,    0x7F95, __READ_WRITE);
/* Debug module control register 1 */
__IO_REG8    (DM_CR1,      0x7F96, __READ_WRITE);
/* Debug module control register 2 */
__IO_REG8    (DM_CR2,      0x7F97, __READ_WRITE);
/* Debug module control/status register 1 */
__IO_REG8    (DM_CSR1,     0x7F98, __READ_WRITE);
/* Debug module control/status register 2 */
__IO_REG8    (DM_CSR2,     0x7F99, __READ_WRITE);
/* DM enable function register */
__IO_REG8    (DM_ENFCTR,   0x7F9A, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *
 *  Note: The vector numbers listed in ST's manuals for STM8 are offset
 *        by 2 compared to the vector numbers used by EWSTM8.
 *-----------------------------------------------------------------------*/
#define AWU_vector                            3 /* IRQ No. in STM8 manual:  1 */
#define CLK_CSS_vector                        4 /* IRQ No. in STM8 manual:  2 */
#define CLK_SWITCH_vector                     4 /* IRQ No. in STM8 manual:  2 */
#define EXTI0_vector                          5 /* IRQ No. in STM8 manual:  3 */
#define EXTI1_vector                          6 /* IRQ No. in STM8 manual:  4 */
#define EXTI2_vector                          7 /* IRQ No. in STM8 manual:  5 */
#define EXTI3_vector                          8 /* IRQ No. in STM8 manual:  6 */
#define EXTI4_vector                          9 /* IRQ No. in STM8 manual:  7 */
#define CAN_FMP_vector                       10 /* IRQ No. in STM8 manual:  8 */
#define CAN_FOVR_vector                      10 /* IRQ No. in STM8 manual:  8 */
#define CAN_FULL_vector                      10 /* IRQ No. in STM8 manual:  8 */
#define CAN_RQCP0_vector                     11 /* IRQ No. in STM8 manual:  9 */
#define CAN_RQCP1_vector                     11 /* IRQ No. in STM8 manual:  9 */
#define CAN_RQCP2_vector                     11 /* IRQ No. in STM8 manual:  9 */
#define CAN_WKUI_vector                      11 /* IRQ No. in STM8 manual:  9 */
#define SPI_CRCERR_vector                    12 /* IRQ No. in STM8 manual: 10 */
#define SPI_MODF_vector                      12 /* IRQ No. in STM8 manual: 10 */
#define SPI_OVR_vector                       12 /* IRQ No. in STM8 manual: 10 */
#define SPI_RXNE_vector                      12 /* IRQ No. in STM8 manual: 10 */
#define SPI_TXE_vector                       12 /* IRQ No. in STM8 manual: 10 */
#define SPI_WKUP_vector                      12 /* IRQ No. in STM8 manual: 10 */
#define TIM1_CAPCOM_BIF_vector               13 /* IRQ No. in STM8 manual: 11 */
#define TIM1_CAPCOM_TIF_vector               13 /* IRQ No. in STM8 manual: 11 */
#define TIM1_OVR_UIF_vector                  13 /* IRQ No. in STM8 manual: 11 */
#define TIM1_CAPCOM_CC1IF_vector             14 /* IRQ No. in STM8 manual: 12 */
#define TIM1_CAPCOM_CC2IF_vector             14 /* IRQ No. in STM8 manual: 12 */
#define TIM1_CAPCOM_CC3IF_vector             14 /* IRQ No. in STM8 manual: 12 */
#define TIM1_CAPCOM_CC4IF_vector             14 /* IRQ No. in STM8 manual: 12 */
#define TIM1_CAPCOM_COMIF_vector             14 /* IRQ No. in STM8 manual: 12 */
#define TIM2_OVR_UIF_vector                  15 /* IRQ No. in STM8 manual: 13 */
#define TIM2_CAPCOM_CC1IF_vector             16 /* IRQ No. in STM8 manual: 14 */
#define TIM2_CAPCOM_CC2IF_vector             16 /* IRQ No. in STM8 manual: 14 */
#define TIM2_CAPCOM_CC3IF_vector             16 /* IRQ No. in STM8 manual: 14 */
#define TIM2_CAPCOM_TIF_vector               16 /* IRQ No. in STM8 manual: 14 */
#define TIM3_OVR_UIF_vector                  17 /* IRQ No. in STM8 manual: 15 */
#define TIM3_CAPCOM_CC1IF_vector             18 /* IRQ No. in STM8 manual: 16 */
#define TIM3_CAPCOM_CC2IF_vector             18 /* IRQ No. in STM8 manual: 16 */
#define TIM3_CAPCOM_CC3IF_vector             18 /* IRQ No. in STM8 manual: 16 */
#define USART_T_TC_vector                    19 /* IRQ No. in STM8 manual: 17 */
#define USART_T_TXE_vector                   19 /* IRQ No. in STM8 manual: 17 */
#define USART_R_IDLE_vector                  20 /* IRQ No. in STM8 manual: 18 */
#define USART_R_LBDF_vector                  20 /* IRQ No. in STM8 manual: 18 */
#define USART_R_PE_vector                    20 /* IRQ No. in STM8 manual: 18 */
#define USART_R_RXNE_vector                  20 /* IRQ No. in STM8 manual: 18 */
#define I2C_ADD10_vector                     21 /* IRQ No. in STM8 manual: 19 */
#define I2C_ADDR_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_AF_vector                        21 /* IRQ No. in STM8 manual: 19 */
#define I2C_ARLO_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_BERR_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_BTF_vector                       21 /* IRQ No. in STM8 manual: 19 */
#define I2C_OVR_vector                       21 /* IRQ No. in STM8 manual: 19 */
#define I2C_RXNE_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define I2C_SB_vector                        21 /* IRQ No. in STM8 manual: 19 */
#define I2C_STOPF_vector                     21 /* IRQ No. in STM8 manual: 19 */
#define I2C_TXE_vector                       21 /* IRQ No. in STM8 manual: 19 */
#define I2C_WUFH_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define LINUART_TC_vector                    22 /* IRQ No. in STM8 manual: 20 */
#define LINUART_TXE_vector                   22 /* IRQ No. in STM8 manual: 20 */
#define LINUART_IDLE_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define LINUART_LBDF_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define LINUART_LHDF_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define LINUART_OR_vector                    23 /* IRQ No. in STM8 manual: 21 */
#define LINUART_PE_vector                    23 /* IRQ No. in STM8 manual: 21 */
#define LINUART_RXNE_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define ADC_AWD_vector                       24 /* IRQ No. in STM8 manual: 22 */
#define ADC_EOC_vector                       24 /* IRQ No. in STM8 manual: 22 */
#define TIM4_OVR_UIF_vector                  25 /* IRQ No. in STM8 manual: 23 */
#define FLASH_EOP_vector                     26 /* IRQ No. in STM8 manual: 24 */
#define FLASH_WR_PG_DIS_vector               26 /* IRQ No. in STM8 manual: 24 */

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTM8AF51A8_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
